# Movies 3

## Introduction

Une base de données (hébergée dans le cloud AWS) contenant un certain nombre de données cinématographiques vous est fournie pour exploration et mise en pratique des langages SQL et Python.  
Les données de connexion (user, host) sont indiquées dans le brief, le mot de passe nécessaire est précisé en session par le formateur.

## 1. Description Générale

En utilisant DBeaver et les paramètres de connexion donnés par ailleurs, faire une description détaillée de la base de données fournie. Présenter notamment le diagramme entité - relation (ERD) et les différentes caractéristiques des tables de la base.  Quelles types de renseignement peut-on tirer de cette base de données ?

---

## 2. Exploration SQL via python / pandas
Dans cette partie, on s'attache à explorer la base de données en utilisant le language SQL pour les requêtes et le language Python (+ module pandas) pour récupérer les résultats de façon programmatique.  
Vous pouvez utiliser DBeaver ou outil similaire pour préparer / tester vos requêtes mais celles-ci doivent être reportées et appliquées dans du code Python comme présenté dans les quelques examples à suivre.  
*Pour les résultats "longs", un aperçu des quelques premières lignes et le comptage total des résultats est suffisant.*

In [2]:
import os
import pandas as pd

In [3]:
from sqlalchemy import create_engine
import pymysql

In [4]:
# paramètres de connexion à la base de données movies (MySQL sous AWS RDS)
user = 'student'
password = 'dev-data-nte-2021'
host = 'simplon-mysql.cpreezidasug.eu-west-1.rds.amazonaws.com'
port = 3306
dbname = 'movies'  

engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}/{dbname}")

### Exemples

#### Tables de base

In [13]:
movies = pd.read_sql_query("SELECT * FROM movies LIMIT 10", engine)
movies.head()

,id,title,year,directorId,genre,summary,countrycode
0,11,La Guerre des étoiles,1977,1,Aventure,"Il y a bien longtemps, dans une galaxie très l...",US
1,24,Kill Bill : Volume 1,2003,138,Action,Au cours d'une cérémonie de mariage en plein d...,US
2,28,Apocalypse Now,1979,1776,Drame,L'état-major américain confie au jeune capitai...,US
3,33,Impitoyable,1992,190,Western,"Après avoir été un impitoyable tueur, toujours...",US
4,38,Eternal Sunshine of the Spotless Mind,2004,201,Science-Fiction,Joël et Clémentine ne voient plus que les mauv...,US

In [14]:
artists = pd.read_sql_query("SELECT * FROM artists LIMIT 10", engine)
artists.head()

   id lastname firstname  birthyear
0   1    Lucas    George       1944
1   2   Hamill      Mark       1951
2   3     Ford  Harrison       1942
3   4   Fisher    Carrie       1956
4   5  Cushing     Peter       1913

In [15]:
roles = pd.read_sql_query("SELECT * FROM roles LIMIT 10", engine)
roles.head()

   movieId  actorId                            character
0       11        2                       Luke Skywalker
1     1891        2                       Luke Skywalker
2     1892        2                       Luke Skywalker
3   181808        2  Luke Skywalker / Dobbu Scay (voice)
4       11        3                             Han Solo

In [16]:
countries = pd.read_sql_query("SELECT * FROM countries LIMIT 10", engine)
countries.head()

  code       name language
0   AU  Australia
1   BE    Belgium
2   BS    Bahamas
3   CA     Canada
4   CN      China

#### Autre requête simple
Q00: Nom et année de naissance des artistes nés après 1975 ? Combien sont-ils ?

In [17]:
sql_query_00 = """
    SELECT *
    FROM artists
    WHERE birthyear > 1975
"""

results = pd.read_sql_query(sql_query_00, engine)
results.head(5)

    id       lastname firstname  birthyear
0  131     Gyllenhaal      Jake       1980
1  205          Dunst   Kirsten       1982
2  225         Holmes    Ashton       1978
3  258  García Bernal      Gael       1978
4  368    Witherspoon     Reese       1976

In [18]:
results.shape

(118, 4)

In [19]:
len(results)

118

### Questions

Q01: Quels sont les films de type 'Drame' ? Combien cela représente de films ?

In [9]:
drame = pd.read_sql_query("SELECT title FROM movies WHERE genre='Drame'", engine)
drame

                                 title
0                       Apocalypse Now
1                A History of Violence
2                          Match point
3      Le Secret de Brokeback Mountain
4                   Breaking the Waves
..                                 ...
78                    Une vie violente
79                           En guerre
80                              Amanda
81  Green Book : Sur les routes du sud
82                            Parasite

[83 rows x 1 columns]

Q02: Quels rôles a joué Bruce Willis et dans quels films (triés par ordre chronologique) ?

In [81]:
bruce = pd.read_sql_query("SELECT id FROM artists WHERE lastname='Willis' and firstname='Bruce'", engine)
films = pd.read_sql_query(f"SELECT movieId, `character`, title FROM roles INNER JOIN movies ON roles.movieId = movies.id WHERE actorId={bruce.id[0]}", engine)
films

   movieId       character                         title
0      562    John McClane              Piège de cristal
1      680  Butch Coolidge                  Pulp Fiction
2     1571    John McClane  Die Hard 4 : Retour en enfer
3     1572    John McClane          Une Journée en enfer
4     1573    John McClane         58 minutes pour vivre

Q03: Qui est le réalisateur de Memento ?

In [87]:
memento_real = pd.read_sql_query("SELECT directorId, lastname, firstname FROM movies INNER JOIN artists ON movies.directorId = artists.id WHERE title='Memento'", engine)
memento_real

   directorId lastname    firstname
0         525    Nolan  Christopher

Q04: Qui a joué le rôle de Chewbacca et dans quels films ?

Q05: Dans quels films Bruce Willis a-t-il joué le role de John McClane ?

Q06: Quels sont les acteurs de 'Sueurs froides' ?

Q07: Quels sont les films dont le réalisateur est Tim Burton, et l’un des acteurs Jonnhy Depp ?

Q08: Quels sont les films dans lesquels a joué Woody Allen ? Donnez aussi le rôle.

Q09: Quel metteur en scène a tourné dans ses propres films ? Donnez le nom, le rôle et le titre des films en question.

Q10: Quels sont les films de Quentin Tarantino dans lesquels il n’a pas joué

Q11: Quel metteur en scène a tourné en tant qu’acteur ? Donner le nom, le rôle et le titre des films dans lesquels cet artiste a joué.

Q12: Quels sont les films de Hitchcock sans James Stewart

Q13: Quel est la filmographie de James Stewart ?

Q14: Quels sont les films sans rôle (acteurs) ?

Q15: Combien d'acteurs n’ont jamais réalisé de film ?

Q16: Donnez les noms et prénoms des 10 réalisateurs les plus prolifiques, ainsi que le nombre de films qu’ils ont tournés ?

Q17: Donnez les noms et prénoms des réalisateurs qui ont tourné au moins deux films. Combien sont-ils ?

Q18: Dans quels films le réalisateur a-t-il le même prénom que l’un des interprètes ? (titre, nom du réalisateur, nom de l’interprète). Le réalisateur et l’interprète ne doivent pas être la même personne.

Q19: Quels sont les 10 pays produisant le plus de films ?

Q20: Quels sont les 5 acteurs ayant le plus joué dans des films français ?

---

## 3. Expression libre

A vous de jouer ! Tentez quelques requêtes de votre choix (avec pourquoi pas quelques graphiques illustratifs en utilisant Matplotlib...)